In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [15]:
rann= np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(3,4), ['A', 'B', 'C'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [19]:
#indexing and selecting

In [21]:
df['W'] # to return W column

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [22]:
type(df['W'])

pandas.core.series.Series

In [23]:
df.W #you can also write df.column name, but column_name and dataframes method can coincide or overwritten. So,  inorder to avoid ambiguity, we usually use bracket notation.

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
#you can also plass list of column and get dataframe containing those series 
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001

In [28]:
#Specify new column. You can perform arithmetic to pull of new column

df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [44]:
#for removing column

df.drop('new', axis=1) 
# argument = labels, axis, inplace = True
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
df.drop('X', axis=1, inplace=True) 
df

#inplace = True, removes the column permanently

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001

In [49]:
#We can also use df.drop to drop rows
df.drop('C') #default axis=0

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965

In [53]:
df

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001

In [54]:
df.shape #it's a tuple

(3, 3)

In [55]:
# at 0 index we have 3 rows and at index 1we have 3 colum
df

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001

In [56]:
df.loc['']

In [ ]:
#ROWS

In [59]:
df.loc['A']

W    2.706850
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [60]:
df.iloc[2] #for numerical based index

W   -2.018168
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [61]:
df.loc['B', 'Y'] #you can pass row, column  notation

-0.8480769834036315

In [65]:
df.loc[['A', 'B'], ['W', 'Y']] #row A,B; Column W,Y

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077